import re

"""
贪婪模式下：（没有?）
满足第一个表达式，第二个表达式次数灵活时，全部匹配给第一个
第二个表达式次数有限制，限制几次匹配几次
非贪婪模式下：（有?）
满足第一个表达式，考虑第二个表达式次数，对其匹配
第二个表达式灵活，对其全匹配，限制次数，限制几次匹配几次
"""
print(re.match(r"^(\d+)(0*)$", "1234000").groups())  # ('1234000', '') 默认贪婪模式
print(re.match(r"^(\d+)(0+)$", "1234000").groups())  # ('123400', '0')
print(re.match(r"^(\d+)(0{2})$", "1234000").groups())  # ('12340', '00')
print(re.match(r"^(\d+?)(0*)$", "1234000").groups())  # ('1234', '000') 非贪婪模式
print(re.match(r"^(\d+?)(0{2})$", "1234000").groups())  # ('12340', '00')
